{
    "Ярость Крепости": "Эта контратака усиливает прочность замка, позволяя ему выдержать сильные атаки врагов и уменьшить урон, наносимый замку. Кроме того, она повышает настроение жителей, вдохновляя их на борьбу и защиту своего дома.",
    "Танец Верных": "Контратака использует силу единства и приводит к укреплению прочности замка. Она также поднимает настроение жителей, создавая чувство солидарности и сплоченности в борьбе за их общую безопасность.",
    "Гнев Дракона": "Эта контратака добавляет мощь замку, усиливая его прочность и способность отразить любую атаку врагов. Она также влияет на настроение жителей, внушая им чувство защищенности и безопасности.",
    "Буря Защиты": "Замок активирует эту контратаку, чтобы укрепить свою прочность и создать непроницаемую защиту. Она также положительно влияет на настроение жителей, создавая ощущение безопасности и уверенности в будущем.",
    "Вихрь Могущества": "Контратака укрепляет прочность замка, позволяя ему легко отразить атаки врагов.",
    "Отражение Щита": "Замок активирует эту контратаку, чтобы укрепить свою прочность и отразить любую атаку обратно на врагов. Она также поднимает настроение жителей, создавая чувство защищенности и надежности.",
    "Власть Бастиона": "Контратака укрепляет прочность замка и повышает его защитные возможности. Она также положительно влияет на настроение жителей, придавая им уверенность в силе и надежности своего бастиона.",
    "Рев Каменных Стен": "Замок издает громкий рев, который укрепляет его стены и уменьшает урон, наносимый замку. Это также влияет на настроение жителей, придавая им чувство безопасности и защищенности.",
    "Пламень Ответа": "Контратака позволяет замку сжигать атакующих врагов, уменьшая их силу и прочность. Она также влияет на настроение жителей, демонстрируя им, что их замок готов отплатить за любую угрозу.",
    "Тень Замочной Скважины": "Замок использует эту контратаку, чтобы погрузить врагов во тьму и уменьшить их прочность. Она также влияет на настроение жителей, создавая ощущение безопасности и сокрытности внутри своих стен.",
    "Волна Сопротивления": "Контратака создает мощную волну энергии, которая укрепляет прочность замка и отталкивает врагов. Она также повышает настроение жителей, демонстрируя им, что их замок способен сопротивляться любым угрозам.",
    "Сокрушение Врага": "Замок активирует эту контратаку, чтобы сокрушить врагов и уменьшить их прочность. Она также влияет на настроение жителей, демонстрируя им, что их замок способен противостоять любым атакам.",
    "Молот Правосудия": "Контратака вызывает молот правосудия, который наносит урон врагам и уменьшает их прочность. Она также влияет на настроение жителей, создавая чувство справедливости и защиты.",
    "Защитный Бастион": " Контратака укрепляет прочность замка и создает надежную защиту от врагов. Она также положительно влияет на настроение жителей, придавая им чувство безопасности и спокойствия.",
    "Призыв Героев": "Когда замок активирует эту контратаку, он призывает древних героев, которые помогают укрепить его прочность и повышают настроение жителей, внушая им чувство надежности и нерушимости.",
    "Взрывная Реакция": "Контратака отражает атаки врагов и наносит им урон, уменьшая их прочность. Она также влияет на настроение жителей, демонстрируя им, что их замок готов ответить на любую угрозу.",
    "Железная Стена": "Контратака укрепляет прочность замка, превращая его в непробиваемую железную стену. Она также влияет на настроение жителей, создавая ощущение непоколебимой защиты и безопасности.",
    "Защитное Окование": "Замок окружает себя защитным окованием, которое делает его неуязвимым для атак врагов. Оно также влияет на настроение жителей, придавая им чувство непроницаемой защиты и спокойствия.",
    "Молния Победы": "Контратака создает мощную молнию, которая поражает врагов и уменьшает их прочность. Она также влияет на настроение жителей, демонстрируя им, что их замок способен победить любую угрозу.",
    "Череп Сопротивления": "Замок использует эту контратаку, чтобы призвать дух могущества, воплощающего его сопротивление. Она укрепляет прочность замка и влияет на настроение жителей, придавая им уверенность в своем замке и его способности защищать их."
}